In [1]:
#!pip install ipython-sql
#!git clone https://github.com/thomasnield/oreilly_getting_started_with_sql.git

In [2]:
%load_ext sql

In [3]:
%sql sqlite:///oreilly_getting_started_with_sql/rexon_metals.db

'Connected: @oreilly_getting_started_with_sql/rexon_metals.db'

# SELECT

When working with databases and SQL, the most common task is to request data from one or more tables and display it. 

The `SELECT` statement accomplishes this.

## Retrieving Data with SQL

Let’s write our first SQL statement. The most common SQL operation is a `SELECT` statement, which pulls data from a table and then displays the results. 

Write the following statement:

In [4]:
%sql SELECT * FROM CUSTOMER;

 * sqlite:///oreilly_getting_started_with_sql/rexon_metals.db
Done.

[(1, 'LITE Industrial', 'Southwest', '729 Ravine Way', 'Irving', 'TX', 75014),
 (2, 'Rex Tooling Inc', 'Southwest', '6129 Collie Blvd', 'Dallas', 'TX', 75201),
 (3, 'Re-Barre Construction', 'Southwest', '9043 Windy Dr', 'Irving', 'TX', 75032),
 (4, 'Prairie Construction', 'Southwest', '264 Long Rd', 'Moore', 'OK', 62104),
 (5, 'Marsh Lane Metal Works', 'Southeast', '9143 Marsh Ln', 'Avondale', 'LA', 79782)]

Let’s break down exactly what happened. A SELECT statement allows you to choose which columns to pull from a table. So the first part of the SQL shown here should be read as “Select all columns,” where * is a placeholder to specify all columns.

And you are getting these columns from the CUSTOMER table.

You do not have to pull all columns in a SELECT statement. You can also pick and choose only the columns you are interested in. The following query will only pull the CUSTOMER_ID and NAME columns:

In [7]:
%sql SELECT CUSTOMER_ID, NAME FROM CUSTOMER;

 * sqlite:///oreilly_getting_started_with_sql/rexon_metals.db
Done.

[(1, 'LITE Industrial'),
 (2, 'Rex Tooling Inc'),
 (3, 'Re-Barre Construction'),
 (4, 'Prairie Construction'),
 (5, 'Marsh Lane Metal Works')]

## Expression in SELECT Statements

The SELECT statement can do far more than simply select columns. You can also do calculations on one or more columns and include them in your query result. Let’s work with another table called PRODUCT.

In [8]:
%sql SELECT * FROM PRODUCT;

 * sqlite:///oreilly_getting_started_with_sql/rexon_metals.db
Done.

[(1, 'Copper', 7.51),
 (2, 'Aluminum', 2.58),
 (3, 'Silver', 15),
 (4, 'Steel', 12.31),
 (5, 'Bronze', 4),
 (6, 'Duralumin', 7.6),
 (7, 'Solder', 14.16),
 (8, 'Stellite', 13.31),
 (9, 'Brass', 4.75)]

Suppose we wanted to generate a calculated column called TAXED_PRICE that is 7% higher than PRICE. We could use a SELECT query to dynamically calculate this for us

In [9]:
%%sql

SELECT
PRODUCT_ID,
DESCRIPTION,
PRICE,
PRICE * 1.07 AS TAXED_PRICE
FROM PRODUCT;

 * sqlite:///oreilly_getting_started_with_sql/rexon_metals.db
Done.

[(1, 'Copper', 7.51, 8.0357),
 (2, 'Aluminum', 2.58, 2.7606),
 (3, 'Silver', 15, 16.05),
 (4, 'Steel', 12.31, 13.171700000000001),
 (5, 'Bronze', 4, 4.28),
 (6, 'Duralumin', 7.6, 8.132),
 (7, 'Solder', 14.16, 15.151200000000001),
 (8, 'Stellite', 13.31, 14.241700000000002),
 (9, 'Brass', 4.75, 5.0825000000000005)]

Notice how the TAXED_PRICE column was dynamically calculated in the SELECT query. This column is not stored in the table, but rather calculated and displayed to us every time we run this query.

Let’s take a look at our TAXED_PRICE column and break down how it was created. We first see the PRICE is multiplied by 1.07 to calculate the taxed amount. We generate this TAXED_PRICE value for every record.

Notice too that we gave this calculated value a name using an AS statement (this is known as an alias):

We can use aliases to give names to expressions. We can also use aliases to apply a new name to an existing column within the query. For example, we can alias the PRICE column to UNTAXED_PRICE. This does not actually change the name of the column in the table, but it gives it a new name within the scope of our SELECT statement:

In [10]:
%%sql
SELECT
PRODUCT_ID,
DESCRIPTION, 
PRICE AS UNTAXED_PRICE,
PRICE * 1.07 AS TAXED_PRICE
FROM PRODUCT

 * sqlite:///oreilly_getting_started_with_sql/rexon_metals.db
Done.

[(1, 'Copper', 7.51, 8.0357),
 (2, 'Aluminum', 2.58, 2.7606),
 (3, 'Silver', 15, 16.05),
 (4, 'Steel', 12.31, 13.171700000000001),
 (5, 'Bronze', 4, 4.28),
 (6, 'Duralumin', 7.6, 8.132),
 (7, 'Solder', 14.16, 15.151200000000001),
 (8, 'Stellite', 13.31, 14.241700000000002),
 (9, 'Brass', 4.75, 5.0825000000000005)]

To round the TAXED_PRICE to two decimal places, we can pass the multiplication expression PRICE * 1.07 as the first argument, and a 2 as the second:

In [11]:
%%sql
SELECT
PRODUCT_ID,
DESCRIPTION, 
PRICE AS UNTAXED_PRICE,
round(PRICE * 1.07,2) AS TAXED_PRICE
FROM PRODUCT

 * sqlite:///oreilly_getting_started_with_sql/rexon_metals.db
Done.

[(1, 'Copper', 7.51, 8.04),
 (2, 'Aluminum', 2.58, 2.76),
 (3, 'Silver', 15, 16.05),
 (4, 'Steel', 12.31, 13.17),
 (5, 'Bronze', 4, 4.28),
 (6, 'Duralumin', 7.6, 8.13),
 (7, 'Solder', 14.16, 15.15),
 (8, 'Stellite', 13.31, 14.24),
 (9, 'Brass', 4.75, 5.08)]

Here are the mathematical operators you can use in SQL:

| Operator 	| Description                                   	| Example              	|
|----------	|-----------------------------------------------	|----------------------	|
| +        	| Adds two numbers                              	| STOCK + NEW_SHIPMENT 	|
| -        	| Subtracts two numbers                         	| STOCK - DEFECTS      	|
| *        	| Multiplies two numbers                        	| PRICE * 1.07         	|
| /        	| Divides two numbers                           	| STOCK / PALLET_SIZE  	|
| %        	| Divides two, numbers but return the remainder 	| STOCK % PALLET_SIZE  	|

## Text Concatenation

The concatenate operator is specified by a double pipe (||), and you put the data values to concatenate on both sides of it.

In [12]:
%%sql
SELECT NAME,
CITY || ', ' || STATE AS LOCATION
FROM CUSTOMER;

 * sqlite:///oreilly_getting_started_with_sql/rexon_metals.db
Done.

[('LITE Industrial', 'Irving, TX'),
 ('Rex Tooling Inc', 'Dallas, TX'),
 ('Re-Barre Construction', 'Irving, TX'),
 ('Prairie Construction', 'Moore, OK'),
 ('Marsh Lane Metal Works', 'Avondale, LA')]

In [18]:
%%sql
SELECT NAME,
STREET_ADDRESS || ' ' || CITY || ', ' || STATE || ' ' || ZIP AS SHIP_ADDRESS
FROM CUSTOMER;

 * sqlite:///oreilly_getting_started_with_sql/rexon_metals.db
Done.

[('LITE Industrial', '729 Ravine Way Irving, TX 75014'),
 ('Rex Tooling Inc', '6129 Collie Blvd Dallas, TX 75201'),
 ('Re-Barre Construction', '9043 Windy Dr Irving, TX 75032'),
 ('Prairie Construction', '264 Long Rd Moore, OK 62104'),
 ('Marsh Lane Metal Works', '9143 Marsh Ln Avondale, LA 79782')]

## Summary
In this section, we covered how to use the SELECT statement, the most common SQL operation. It retrieves and transforms data from a table without affecting the table itself. We also learned how to select columns and write expressions.

Within expressions, we can use operators and functions to do tasks such as rounding, math, and concatenation.